Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСпособовОтраженияЗарплатыВБухУчете</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьВходящиеДанныеЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/НастройкаСпособовОтраженияЗарплатыВБухУчете/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		ОтборОрганизация = Параметры.Отбор.Организация;
		УстановитьОтборСписка("Организация", ОтборОрганизация);
	Иначе
		ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(ЭтаФорма, "Список", "Организация", ОтборОрганизация)
	КонецЕсли;
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
	МассивПараметровВыбораВидаОперации = РегистрыСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.МассивПараметровВыбораВидаОперации();
	Элементы.ОтборВидОперации.ПараметрыВыбора = МассивПараметровВыбораВидаОперации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборСписка("Актуальность", ОтборАктуальность, (ОтборАктуальность = 0));
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтборСписка("Организация", ОтборОрганизация);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОперацииПриИзменении(Элемент)
	УстановитьОтборСписка("ВидОперации", ОтборВидОперации);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетПриИзменении(Элемент)
	УстановитьОтборСписка("СчетДт", ОтборСчет);
КонецПроцедуры

&НаКлиенте
Процедура ОтборАктуальностьПриИзменении(Элемент)
	УстановитьОтборСписка("Актуальность", ОтборАктуальность, (ОтборАктуальность = 0));
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборСписка(ПолеОтбора, ЗначениеОтбора, Использование = Неопределено)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	Список.Отбор, 
	ПолеОтбора, 
	ЗначениеОтбора, 
	ВидСравненияКомпоновкиДанных.Равно, 
	, 
	?(Использование = Неопределено, ЗначениеЗаполнено(ЗначениеОтбора), Использование));
	
КонецПроцедуры
													
&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Элементы.Организация.Видимость = Не ЗначениеЗаполнено(ОтборОрганизация);
	Элементы.ВидОперации.Видимость = Не ЗначениеЗаполнено(ОтборВидОперации);
	Элементы.ВидОперации.Видимость = Не ЗначениеЗаполнено(ОтборСчет);
КонецПроцедуры

#КонецОбласти
